#include <stdio.h>
#include <stdlib.h>

#include "menu_scene.h"

#include "../renderer/renderer.h"
#include "../system/input.h"
#include "../system/console.h"

#include "../resource/logo.h"

#include "../audio/audio.h"

void ShowMenuScene();

void ShowSettings() 
{
    ClearConsole();
    printf("\n       0. 돌아가기\n");
    printf("\n       1. PokerPoker 게임 규칙 확인하기\n");
    printf("\n       2. 소리 설정\n");
    int tmp; 
    scanf_s("%d", &tmp);

    switch (tmp)
    {
    case 0:
        ShowMenuScene();
		break;
    case 1:
		ClearConsole();
        printf("\n┌───────────────────────────────────────────────────────┐\n");
        printf("\n       0. 아무 키나 눌러 돌아가기\n");
        printf("\n       \n");
        printf("\n       PokerPoker는 [텍사스 홀덤]을 기반으로 하는 포커 게임입니다.\n");
        printf("\n       플레이어는 50개의 칩을 가지고 시작하며, 칩을 전부 잃으면 라이프가 1 감소됩니다.\n");
        printf("\n       라이프는 총 5개를 가지고 있으니, 신중하게 결정하세요.\n");
        printf("\n       \n");
        printf("\n       당신이 싸울 상대는 [만능 AI포커]입니다.\n");
        printf("\n       그것에 이길 경우, 그것은 점차 강해집니다.\n");
        printf("\n       그러니 항상 방심하지 마십시오.\n");
        printf("\n       \n");
        printf("\n       승리 기준은 [텍사스 홀덤]을 기반으로 진행되며, 족보 또한 동일합니다.\n");
        printf("\n       \n");
        printf("\n       그럼 즐거운 시간 되십시오.\n");
        printf("\n            ##############################################################\n"
            "            ##############################################################\n"
            "            ##############################################################\n"
            "            ##############################################################\n"
            "            ##################          ####           ###################\n"
            "            ################                             #################\n"
            "            ###############     #######       #######     ################\n"
            "            ##############    ###########   ###########   ################\n"
            "            ##############   ###########################   ###############\n"
            "            ##############   ###########################   ###############\n"
            "            ##############    #########################   ################\n"
            "            ###############   ########################    ################\n"
            "            ################    #####################    #################\n"
            "            #################     #################     ##################\n"
            "            ##################      #############      ###################\n"
            "            ####################      #########      #####################\n"
            "            ######################      #####      #######################\n"
            "            ########################             #########################\n"
            "            ##########################        ############################\n"
            "            ############################     #############################\n"
            "            ##############################################################\n"
            "            ##############################################################\n"
            "            ##############################################################\n");
        printf("\n└───────────────────────────────────────────────────────┘\n");
		WaitAnyKey();
        ShowMenuScene();
        break;                           

    case 2:
        while (1)
        {
            ClearConsole();
            

            printf("\n원하시는 소리 출력값을 입력해주세요. (0~100)\n");
            printf("Q를 눌러 나가기\n\n");

            char input[32];
            scanf_s("%31s", input, (unsigned)_countof(input));

            if (input[0] == 'Q' || input[0] == 'q')
            {
                ShowSettings();
                break;
            }

            int soundtmp = atoi(input);

            if (soundtmp < 0 || soundtmp > 100)
            {
                printf("\n잘못된 입력입니다.\n");
                Sleep(1000);
                continue;
            }

            printf("\n소리 값이 설정되었습니다.\n");

            SetVolume(soundtmp);

            Sleep(600);
        }

        
    }

    return;
}


void ShowMenuScene()
{
    ClearConsole();

    DrawGameLOGO(GAME_LOGO);

    printf("\n       아무 키나 눌러 시작\n");
    printf("\n       Q를 누르면 설정\n");

    if (SetSettings())
    {
		ShowSettings();
    }
}